# -*- ii: apisnoop; -*-
#+TITLE: deleteCoreV1CollectionNamespacedPodTemplate Mock Test
#+AUTHOR: Stephen Heywood
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+OPTIONS: toc:nil tags:nil todo:nil
#+EXPORT_SELECT_TAGS: export
** Test the functionality in Go
   #+begin_src go :wrap "example"
     package main

     import (
       // "encoding/json"
       "fmt"
       "time"
       "flag"
       "os"
       v1 "k8s.io/api/core/v1"
       // "k8s.io/client-go/dynamic"
       // "k8s.io/apimachinery/pkg/runtime/schema"
       metav1 "k8s.io/apimachinery/pkg/apis/meta/v1"
       "k8s.io/client-go/kubernetes"
       // "k8s.io/apimachinery/pkg/types"
       "k8s.io/client-go/tools/clientcmd"
     )

     func main() {
       // uses the current context in kubeconfig
       kubeconfig := flag.String("kubeconfig", fmt.Sprintf("%v/%v/%v", os.Getenv("HOME"), ".kube", "config"), "(optional) absolute path to the kubeconfig file")
       flag.Parse()
       config, err := clientcmd.BuildConfigFromFlags("", *kubeconfig)
       if err != nil {
           fmt.Println(err)
           return
       }
       // make our work easier to find in the audit_event queries
       config.UserAgent = "live-test-writing"
       // creates the clientset
       ClientSet, _ := kubernetes.NewForConfig(config)
       // DynamicClientSet, _ := dynamic.NewForConfig(config)
       // podResource := schema.GroupVersionResource{Group: "", Version: "v1", Resource: "pods"}

       // TEST BEGINS HERE

       fmt.Println("create a set of Pod templates with a label")
       podTemplateTestNames := [3]string{"test-podtemplate-1", "test-podtemplate-2", "test-podtemplate-3"}

       for _, podTemplateTestName := range podTemplateTestNames {
         _, err = ClientSet.CoreV1().PodTemplates("default").Create(&v1.PodTemplate{
             ObjectMeta: metav1.ObjectMeta{
             Name: podTemplateTestName,
             Labels: map[string]string{
               "type": "Testing"},
             },
             Template: v1.PodTemplateSpec{
             Spec: v1.PodSpec{
               Containers: []v1.Container{
                 {Name: "nginx", Image: "nginx"},
               },
             },
           },
         })

         if err != nil {
           fmt.Println("[error]", err)
           return
         }
       fmt.Println("[status] created", podTemplateTestName)
       }

       fmt.Println("get a list of Pod templates with a label in the default namespace")
       podTemplateList, err := ClientSet.CoreV1().PodTemplates("default").List(metav1.ListOptions{
         LabelSelector: "type=Testing"})

       fmt.Println("check that there are 3 Pod templates found")
       fmt.Println("[status] Found", len(podTemplateList.Items), "Pod templates")
       if len(podTemplateList.Items) != 3 {
         fmt.Println("[error] Incorrect number of Pod templates found")
         return
       }

       fmt.Println("delete Collection of Pod templates for the label in the default namespace")
       _  = ClientSet.CoreV1().PodTemplates("default").DeleteCollection(&metav1.DeleteOptions{}, metav1.ListOptions{
              LabelSelector: "type=Testing"})
       fmt.Println("[status] DeleteCollection processed")

       time.Sleep(2 * time.Second)

       fmt.Println("get a list of Pod templates with a label in the default namespace")
       podTemplateList, err = ClientSet.CoreV1().PodTemplates("default").List(metav1.ListOptions{
         LabelSelector: "type=Testing"})

       fmt.Println("check that there are no Pod templates found")
       fmt.Println("[status] Found", len(podTemplateList.Items), "Pod templates")
       if len(podTemplateList.Items) != 0 {
         fmt.Println("[error] Incorrect number of Pod templates found")
         return
       }

       // TEST ENDS HERE

       fmt.Println("[status] complete")

     }
   #+end_src

   #+RESULTS:
   #+begin_example
   create a set of Pod templates with a label
   [status] created test-podtemplate-1
   [status] created test-podtemplate-2
   [status] created test-podtemplate-3
   get a list of Pod templates with a label in the default namespace
   check that there are 3 Pod templates found
   [status] Found 3 Pod templates
   delete Collection of Pod templates for the label in the default namespace
   [status] DeleteCollection processed
   get a list of Pod templates with a label in the default namespace
   check that there are no Pod templates found
   [status] Found 0 Pod templates
   [status] complete
   #+end_example

